## Plan for org_account/aft
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 19 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                     NAME                                                                      |
|----------|-----------------------------------------------------------------------------------------------------------------------------------------------|
| update   | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm`                     |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role`                              |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata`                         |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account`                              |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger`            |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger`             |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources`                         |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework` |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline`                      |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions`               |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets`                      |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc`                                  |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail`                                   |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support`                                      |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild`                                                |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref`                                 |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version`                                                |
| recreate | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version`                                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk=" -> "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk=" -> "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ last_modified                  = "2023-05-02T15:48:01.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk=" -> "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk=" -> "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ last_modified                  = "2023-05-02T15:48:50.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ last_modified                  = "2023-05-02T15:48:33.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ last_modified                  = "2023-05-02T15:48:04.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources will be updated in-place
  ~ resource "aws_lambda_function" "aft_cleanup_resources" {
        id                             = "aft-cleanup-resources"
      ~ last_modified                  = "2023-05-02T15:48:40.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ last_modified                  = "2023-05-02T15:48:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ last_modified                  = "2023-05-02T15:48:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY=" -> "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_execute_pipeline" {
        id                             = "aft-customizations-execute-pipeline"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "3KjbEZFzCfaw5x+8+cKrFWXZntoaoLfvu86kMFK49c0=" -> "f0TqyHs9yKIa7KIZ6OoHgiyuEZoK6ZccuF1KOAoqNiw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_get_pipeline_executions" {
        id                             = "aft-customizations-get-pipeline-executions"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "3KjbEZFzCfaw5x+8+cKrFWXZntoaoLfvu86kMFK49c0=" -> "f0TqyHs9yKIa7KIZ6OoHgiyuEZoK6ZccuF1KOAoqNiw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_identify_targets" {
        id                             = "aft-customizations-identify-targets"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "3KjbEZFzCfaw5x+8+cKrFWXZntoaoLfvu86kMFK49c0=" -> "f0TqyHs9yKIa7KIZ6OoHgiyuEZoK6ZccuF1KOAoqNiw="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc will be updated in-place
  ~ resource "aws_lambda_function" "aft_delete_default_vpc" {
        id                             = "aft-delete-default-vpc"
      ~ last_modified                  = "2023-05-02T15:48:01.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "hQ1A3ezEVnIvyGeYLPnCod03ABsF39sK30BmKLsmBx4=" -> "hChsOstCi7DsZBKs8+bM1VEyrGk50cY6RKddWw+E0cU="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail will be updated in-place
  ~ resource "aws_lambda_function" "aft_enable_cloudtrail" {
        id                             = "aft-enable-cloudtrail"
      ~ last_modified                  = "2023-05-02T15:47:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "hQ1A3ezEVnIvyGeYLPnCod03ABsF39sK30BmKLsmBx4=" -> "hChsOstCi7DsZBKs8+bM1VEyrGk50cY6RKddWw+E0cU="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support will be updated in-place
  ~ resource "aws_lambda_function" "aft_enroll_support" {
        id                             = "aft-enroll-support"
      ~ last_modified                  = "2023-05-02T15:48:01.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1",
        ] -> (known after apply)
      ~ source_code_hash               = "hQ1A3ezEVnIvyGeYLPnCod03ABsF39sK30BmKLsmBx4=" -> "hChsOstCi7DsZBKs8+bM1VEyrGk50cY6RKddWw+E0cU="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.data.aws_lambda_invocation.invoke_codebuild_job will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "invoke_codebuild_job"  {
      ~ id            = "aft-lambda-layer-codebuild-invoker_$LATEST_85ecff383c221a8fb66cb664769de181" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - Status = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild will be updated in-place
  ~ resource "aws_codebuild_project" "codebuild" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/python-layer-builder-aft-common-7t3pnvob"
        name                   = "python-layer-builder-aft-common-7t3pnvob"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
            # (5 unchanged attributes hidden)

          ~ environment_variable {
                name  = "EVENT_RULE_NAME"
              ~ value = "python-layer-builder-aft-common-7t3pnvob-1-10-3" -> "python-layer-builder-aft-common-7t3pnvob-1-10-4"
                # (1 unchanged attribute hidden)
            }
            # (7 unchanged blocks hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version must be replaced
+/- resource "aws_lambda_layer_version" "layer_version" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-02T15:47:53.556+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-10-3" -> (known after apply)
      ~ layer_name                  = "aft-common-1-10-3" -> "aft-common-1-10-4" # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "A9ODjEy6W/HDKoQTskjOul61Zocze2mRRSy5L49KHLw=" -> (known after apply)
      ~ source_code_size            = 19174525 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref will be updated in-place
  ~ resource "aws_ssm_parameter" "aft_framework_repo_git_ref" {
        id             = "/aft/config/aft-pipeline-code-source/repo-git-ref"
      + insecure_value = (known after apply)
        name           = "/aft/config/aft-pipeline-code-source/repo-git-ref"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 7 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version will be updated in-place
  ~ resource "aws_ssm_parameter" "aft_version" {
        id             = "/aft/config/aft/version"
      + insecure_value = (known after apply)
        name           = "/aft/config/aft/version"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 8 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 19 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
